// yarexe - Net Yaroze PS-X EXE package builder.
// https://github.com/gwald/Yarexe

// Note: Standard PS-X elf executables (ie Net Yaroze ecoff files processed with eco2elf) can be used but they have to use the CodeWarrior .pxe extension.

// Build: gcc -static-libgcc -static-libstdc++ -static -O3 yarexe.c -o yarexe
// Linux note: Yarexe is programmed for windows, it uses \ for folders, and it does NOT handle case differences, it will not find files.


// Yarexe is a poor hack job of the following:


// combine.exe
// Yaroze PS-X EXE builder v2.10
// Copyright (C) Barubary 1998.  All rights not expressly granted reserved.
// Yaroze and PS-X are trademarks of Sony Computer Entertainment, Inc.

// THIS SOURCE CODE MAY ONLY BE MODIFIED FOR PERSONAL USE.  YOU MAY NOT
// DISTRIBUTE MODIFIED VERSIONS OF THIS SOURCE CODE OR THE PROGRAM COMPILED
// FROM MODIFIED SOURCE CODE, BUT YOU MAY MODIFY IT FOR PERSONAL USE.

// THIS PROGRAM AND ITS DOCUMENTATION MAY BE DISTRIBUTED TO ANYONE, PROVIDED
// IT IS NOT MODIFIED NOR ANY CHARGE IS ASSOCIATED WITH DISTRIBUTION.
// NO WARRANTY.

/*
 * eco2exe.c v0.01 Andrew Kieschnick <andrewk@mail.utexas.edu>
 *
 * converts MIPSEL-LE ecoff to PS-X EXE
 *
 * THIS SOURCE WAS MODIFIED (SLIGHTLY) TO WORK UNDER DOS
 * IF YOU USE UNIX, GET THE THE UNMODIFIED SOURCE
 *
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.
 *
 */

/*
 * exefixup.c v0.02 Andrew Kieschnick <andrewk@mail.utexas.edu>
 *
 * displays PS-X EXE header information
 * offers to fix incorrect t_size
 * offers to pad to 2048-byte boundary for cd-rom use
 *
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.
 *
 */

// CodeWarrior PS-X EXE File Patcher By ~imilco (Peter Armstrong)


// ecoff a.out format from siocon src
/*
 *	Copyright (C) 1997 by Sony Computer Entertainment
 *			All rights Reserved
 */






#define YAREXE_VER "YAREXE - v5 June 2023 - bug fixes"
#define YAREXE "Net Yaroze PS-X packager"

/*
 * v5 - bug fixes
 * v4 - CodeWarrior and included Libps.exe
 */


#include <stdio.h>
#include <malloc.h>
#include <string.h>
#include <stdlib.h>
#include <unistd.h>
#include <ctype.h> // tolower/upper



#define USE_ECO2EXE_SOURCE
#define COMBINE_TMP_FILENAME "COMBINE.TMP"

#ifdef USE_ECO2EXE_SOURCE
int eco2exe_main(char *filename);
int exeFixUp_main( char *filename);
#endif



// ecoff a.out format from siocon src
typedef struct filehdr {
	unsigned short	f_magic;	//00 -02 /* magic number */
	unsigned short	f_nscns;	//02 -04 /* number of sections */
	unsigned int		f_timdat;	// 04 -08 /* time & date stamp */
	unsigned int		f_symptr;	// 08 -12 /* file pointer to symbolic header */
	unsigned int		f_nsyms;	// 12 -16 /* sizeof(symbolic hdr) */
	unsigned short	f_opthdr; // 16 -18		/* sizeof(optional hdr) */
	unsigned short	f_flags; // 18 -20		/* flags */
}FILEHDR;

typedef	struct aouthdr {
	unsigned short	magic;   // 20 -22		 00 -02 0x62 and 0x01
	unsigned short	vstamp;  // 22 -24
	unsigned int	tsize;  // 24 -28
	unsigned int	dsize;  //28 -32
	unsigned int	bsize;  //32 -36
	unsigned int	entry; //36 -40
	unsigned int	text_start;  //40 -44
	unsigned int	data_start;	//44 -48
	unsigned int	bss_start; //48 -52
	unsigned int	gprmask; //52 -56
	unsigned int	cprmask[4]; //56 -72
	unsigned int	gp_value; // 72 -76
} AOUTHDR;


typedef struct scnhdr { // 40bytes
	char		s_name[8];		/* 76  - 84 section name */
	unsigned int		s_paddr;		/* 84  - 88 physical address, aliased s_nlib */
	unsigned int		s_vaddr;		/* 88  - 92 virtual address */
	unsigned int		s_size;			/* 92  - 96 section size */
	unsigned int		s_scnptr;		/* 96  - 100 file ptr to raw data for section */
	unsigned int		s_relptr;		/* 100 - 104 file ptr to relocation */
	unsigned int		s_lnnoptr;		/* 104 - 108 file ptr to gp histogram */
	unsigned short	s_nreloc;	/* 108 - 110 number of relocation entries */
	unsigned short	s_nlnno;	/* 110 - 112 number of gp histogram entries */
	unsigned int		s_flags;		/* 112 - 116 flags */
}SCNHDR;



typedef	struct allEcoffHdr{
	FILEHDR fileHDR;
	AOUTHDR ecoHDR;
	SCNHDR  sections[10];
} ECOHDRS;


int patchPXE_CodeWarrior(char *filename);// returns open file pointer to PSX-EXE or fails with NULL



/* Generated by bin2c, do not edit manually */

/* Contents of file libmon22.exe */
extern const long int psx_exe_size;
extern const unsigned char psx_exe[458752];
/* __psx_h_included */



FILE *auto_fileHnd = NULL, *target_fileHnd = NULL, *combine_fileHnd = NULL;
long length1, length2, length3, length4, memorysize = 0;
char *scriptstring = NULL, *memspace = NULL, *memstore = NULL;
unsigned long exec_address = 0, stack_address = 0;
unsigned char *auto_fileBuff=NULL, *filebuffer=NULL,
	      *eco2exe_filename=NULL, systemcalldata[256];


int g_foundYarExe = 0;
int g_verbose = 0;
char g_pxe_filename[256];

long file_length(FILE *handle)
{
	long retval;
	fseek(handle, 0, SEEK_END);
	retval = ftell(handle);
